app/Http/Controllers/BrandController.php

    public function index()
    {
        //

        $brands = Brand::all();
---
select * from `brands`