app/Http/Controllers/productController.php

select * from `brands`
select * from `categories`
select * from `vendors`
---
    public function index()
    {
        $brands = Brand::all();
        $categories = Category::all();
        $vendors = Vendor::all();

select * from `brands` where `brands`.`id` in (1)
select * from `categories` where `categories`.`id` in (1)
select * from `users` where `users`.`id` in (1)
select * from `vendors` where `vendors`.`id` in (1)
---
    public function getProducts(Request $request)
    {
        if ($request->ajax()) {
            $data = product::with(['user','brand','vendor','category'])->get();

select * from `brands` where `brands`.`id` in (1)
select * from `categories` where `categories`.`id` in (1)
select * from `users` where `users`.`id` in (1)
select * from `vendors` where `vendors`.`id` in (1)
---
    public function productsDatatable()
    {
        $products = product::with(['user','brand','vendor','category'])->get();